app/views/users/show.html.erb

SELECT COUNT(*) FROM "products" WHERE "products"."user_id" = 4
---
      <div class="span8">
        <% if @user.products.any? %>