app/views/shared/_user_info.html.erb

SELECT "products".* FROM "products" ORDER BY products.created_at DESC
SELECT COUNT(*) FROM "products" WHERE "products"."user_id" = 1
---
<span>
  <%= pluralize(current_user.products.count, "products") %>