app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY products.created_at DESC
---
  def index
    @products = Product.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY products.created_at DESC LIMIT 1  [["id", "6"]]
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = current_user.products.build(params[:product])

    #respond_to do |format|

      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @product = Product.find(params[:id])