app/controllers/static_pages_controller.rb

SELECT "products".* FROM "products" WHERE (user_id = 1) ORDER BY products.created_at DESC
SELECT "products".* FROM "products" WHERE (user_id = 1) ORDER BY products.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "products" WHERE "products"."user_id" = 1
---
  def home
    if signed_in?
      @product  = current_user.products.build
      @products = Product.all
      @feed_items = current_user.feed.paginate(page: params[:page])