app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @products = @user.products.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = 4 ORDER BY products.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "products" WHERE "products"."user_id" = 4

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "users" SET "email" = 'ckesurf@columbia.edu', "password_digest" = '$2a$10$mKJKgzd2.m6UhxQR2my2w.Q/Pd4fYmXh30o720fALtdKKDYhw6TGm', "remember_token" = '-TmvqHNk0Oi4cviHzNObEQ', "updated_at" = '2013-02-09 00:46:01.291090' WHERE "users"."id" = 4